## Plan Result (test_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.api-mgmt.azurerm_api_management.apim
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "cft-api-mgmt-test"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "cft-perftest-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be created
  + resource "azurerm_api_management" "apim" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + management_api_url            = (known after apply)
      + name                          = "cft-api-mgmt-test"
      + notification_sender_email     = "apimgmt-noreply@mail.windowsazure.com"
      + policy                        = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "DTSPlatformOperations@justice.gov.uk"
      + publisher_name                = "HMCTS Platform Operations"
      + resource_group_name           = "cft-perftest-network-rg"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + virtual_network_type          = "Internal"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + security {
          + enable_backend_ssl30                                = false
          + enable_backend_tls10                                = false
          + enable_backend_tls11                                = false
          + enable_frontend_ssl30                               = false
          + enable_frontend_tls10                               = false
          + enable_frontend_tls11                               = false
          + tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = false
          + tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = false
          + tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = false
          + tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = false
          + tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = false
          + tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = false
          + tls_rsa_with_aes256_gcm_sha384_ciphers_enabled      = false
          + triple_des_ciphers_enabled                          = false
        }

      + virtual_network_configuration {
          + subnet_id = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/virtualNetworks/cft-perftest-vnet/subnets/api-management"
        }
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-test" # forces replacement -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-test/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-platform-test-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappstest/providers/Microsoft.Authorization/roleAssignments/233aca4a-d2b3-9cba-aad3-dc180cabed30" -> (known after apply)
      ~ name                             = "233aca4a-d2b3-9cba-aad3-dc180cabed30" -> (known after apply)
      ~ principal_id                     = "10974469-beb0-44e8-843f-e31bdd9807dd" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1841,"Program":"tfcmt","SHA1":"","Target":"test_apim","Vars":{}} -->